//********************************************************************************************
/**
 * @brief		将棋クエスト情報取得API
 * @author		@loftkun
 */
//********************************************************************************************
var Quest = (function() {
	
	//********************************************************************************************
	/**
	 * @brief		コンストラクタ
	*/
	//********************************************************************************************
	var Quest = function() {
	};

	var quest = Quest.prototype;

	//********************************************************************************************
	/**
	 * @brief		履歴を取得
	 * @param[in]	onSuccess		
	 * @param[in]	onError			
	 * @param[in]	userId		
	 */
	//********************************************************************************************
	quest.getHistory = function(onSuccess, onError, userId, gtype) {
		var http = new Http();
		var param = {	
			userId: userId,
			gtype : gtype,
		};
		http.get('./history/', param, onSuccess, onError);
	};
	
	return Quest;
})();
